In [1]:
import numpy as np
import pandas as pd

![group](Assets\group.png)

In [2]:
df = pd.DataFrame({"key1" : ["a", "a", None, "b", "b", "a", None],
                   "key2" : pd.Series([1, 2, 1, 2, 1, None, 1], dtype="Int64"),
                            "data1" : np.random.standard_normal(7),
                            "data2" : np.random.standard_normal(7)})

In [3]:
df

   key1  key2     data1     data2
0     a     1 -0.444223 -0.464610
1     a     2 -0.220714 -0.525475
2  None     1  2.188420 -1.584287
3     b     2 -0.032658 -0.825786
4     b     1  1.050650  0.362832
5     a  <NA>  0.809552 -0.531752
6  None     1 -0.190208 -2.672044

In [4]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [5]:
grouped.mean()

key1
a    0.048205
b    0.508996
Name: data1, dtype: float64

In [6]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     1      -0.444223
      2      -0.220714
b     1       1.050650
      2      -0.032658
Name: data1, dtype: float64

In [7]:
means

key1  key2
a     1      -0.444223
      2      -0.220714
b     1       1.050650
      2      -0.032658
Name: data1, dtype: float64

In [8]:
means.unstack()

key2         1         2
key1
a    -0.444223 -0.220714
b     1.050650 -0.032658

In [9]:
states = np.array(["OH", "CA", "CA", "OH", "OH", "CA", "OH"])
years = [2005, 2005, 2006, 2005, 2006, 2005, 2006]
df['data1'].groupby([states, years]).mean()

CA  2005    0.294419
    2006    2.188420
OH  2005   -0.238440
    2006    0.430221
Name: data1, dtype: float64

In [10]:
df.groupby('key1').mean()

      key2     data1     data2
key1
a      1.5  0.048205 -0.507279
b      1.5  0.508996 -0.231477

In [11]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    1    -0.444223 -0.464610
     2    -0.220714 -0.525475
b    1     1.050650  0.362832
     2    -0.032658 -0.825786

In [12]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     1       1
      2       1
b     1       1
      2       1
dtype: int64

In [13]:
df.groupby('key1', dropna=False).size()

key1
a      3
b      2
NaN    2
dtype: int64

In [14]:
df.groupby('key1').count()

      key2  data1  data2
key1
a        2      3      3
b        2      2      2

 ## Iterating over Groups

In [15]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1  key2     data1     data2
0    a     1 -0.444223 -0.464610
1    a     2 -0.220714 -0.525475
5    a  <NA>  0.809552 -0.531752
b
  key1  key2     data1     data2
3    b     2 -0.032658 -0.825786
4    b     1  1.050650  0.362832

In the case of multiple keys, the first element in the tuple will be a tuple of key values

In [16]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 1)
  key1  key2     data1    data2
0    a     1 -0.444223 -0.46461
('a', 2)
  key1  key2     data1     data2
1    a     2 -0.220714 -0.525475
('b', 1)
  key1  key2    data1     data2
4    b     1  1.05065  0.362832
('b', 2)
  key1  key2     data1     data2
3    b     2 -0.032658 -0.825786

A recipe
 you may find useful is computing a dictionary of the data pieces as a one-liner

In [17]:
pieces = {name: group for name, group in df.groupby('key1')}

In [18]:
pieces['a']

  key1  key2     data1     data2
0    a     1 -0.444223 -0.464610
1    a     2 -0.220714 -0.525475
5    a  <NA>  0.809552 -0.531752

In [19]:
pieces['b']

  key1  key2     data1     data2
3    b     2 -0.032658 -0.825786
4    b     1  1.050650  0.362832

In [20]:
 grouped = df.groupby({"key1": "key", "key2": "key",
                       "data1": "data", "data2": "data"}, axis="columns")

C:\Users\ahamm\AppData\Local\Temp\ipykernel_10788\2115056569.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  grouped = df.groupby({"key1": "key", "key2": "key",

In [21]:
for group_key, group_values in grouped:
    print(group_key)
    print(group_values)

data
      data1     data2
0 -0.444223 -0.464610
1 -0.220714 -0.525475
2  2.188420 -1.584287
3 -0.032658 -0.825786
4  1.050650  0.362832
5  0.809552 -0.531752
6 -0.190208 -2.672044
key
   key1  key2
0     a     1
1     a     2
2  None     1
3     b     2
4     b     1
5     a  <NA>
6  None     1

## Selecting a Column or Subset of Columns

In [22]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    1    -0.464610
     2    -0.525475
b    1     0.362832
     2    -0.825786

In [23]:
s_grouped = df.groupby(['key1', 'key2'])['data2']

In [24]:
s_grouped

In [25]:
s_grouped.mean()

key1  key2
a     1      -0.464610
      2      -0.525475
b     1       0.362832
      2      -0.825786
Name: data2, dtype: float64

##  Grouping with Dictionaries and Series

In [26]:
people = pd.DataFrame(np.random.standard_normal((5, 5)),
                    columns=["a", "b", "c", "d", "e"],
                    index=["Joe", "Steve", "Wanda", "Jill", "Trey"])

In [27]:
people

              a         b         c         d         e
Joe    0.279470 -0.785899 -0.237410  0.711793  0.830417
Steve -0.091500 -0.269637  1.056377 -1.659350 -0.487326
Wanda -1.161741  0.220939  0.812935  0.509919 -0.327557
Jill   0.731835 -0.691909  0.260982 -0.422764  2.642002
Trey  -1.037359  0.370209 -0.739597  0.143422  0.611255

In [28]:
people.iloc[2:3, [1, 2]] = np.nan
people

              a         b         c         d         e
Joe    0.279470 -0.785899 -0.237410  0.711793  0.830417
Steve -0.091500 -0.269637  1.056377 -1.659350 -0.487326
Wanda -1.161741       NaN       NaN  0.509919 -0.327557
Jill   0.731835 -0.691909  0.260982 -0.422764  2.642002
Trey  -1.037359  0.370209 -0.739597  0.143422  0.611255

In [29]:
 mapping = {"a": "red", "b": "red", "c": "blue",
            "d": "blue", "e": "red", "f" : "orange"}

In [30]:
by_columns = people.groupby(mapping, axis=1)
by_columns.sum()

C:\Users\ahamm\AppData\Local\Temp\ipykernel_10788\3433550516.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  by_columns = people.groupby(mapping, axis=1)

           blue       red
Joe    0.474383  0.323988
Steve -0.602974 -0.848463
Wanda  0.509919 -1.489298
Jill  -0.161782  2.681928
Trey  -0.596176 -0.055895

In [31]:
map_series = pd.Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [32]:
people.groupby(map_series, axis=1).count()

C:\Users\ahamm\AppData\Local\Temp\ipykernel_10788\1833935060.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  people.groupby(map_series, axis=1).count()

       blue  red
Joe       2    3
Steve     2    3
Wanda     1    2
Jill      2    3
Trey      2    3

## Grouping with Functions

In [33]:
people.groupby(len).sum()

          a         b         c         d         e
3  0.279470 -0.785899 -0.237410  0.711793  0.830417
4 -0.305524 -0.321700 -0.478615 -0.279342  3.253257
5 -1.253241 -0.269637  1.056377 -1.149431 -0.814883

In [34]:
key_list = ["one", "one", "one", "two", "two"]
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one  0.279470 -0.785899 -0.237410  0.711793  0.830417
4 two -1.037359 -0.691909 -0.739597 -0.422764  0.611255
5 one -1.161741 -0.269637  1.056377 -1.659350 -0.487326

## Grouping by Index Levels

In [35]:
columns = pd.MultiIndex.from_arrays([["US", "US", "US", "JP", "JP"],                                  
[1, 3, 5, 1, 3]],                                  
names=["cty", "tenor"])

In [36]:
columns

MultiIndex([('US', 1),
            ('US', 3),
            ('US', 5),
            ('JP', 1),
            ('JP', 3)],
           names=['cty', 'tenor'])

In [37]:
hier_df = pd.DataFrame(np.random.standard_normal((4,5)), 
                      columns=columns)

In [38]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.075403  0.582493  0.289646  0.574444 -0.545315
1      0.355791  0.069827 -0.754448 -0.610074 -0.728291
2      1.101416  0.456241 -0.022762  1.411482  1.223759
3      0.276082  0.277554 -0.089353  0.353842 -0.842412

In [39]:
hier_df.groupby(level="tenor", axis="columns").count()

C:\Users\ahamm\AppData\Local\Temp\ipykernel_10788\1243420512.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  hier_df.groupby(level="tenor", axis="columns").count()

tenor  1  3  5
0      2  2  1
1      2  2  1
2      2  2  1
3      2  2  1

## Data Aggregation

![agg](Assets\agg.png)
![agg](Assets\agg1.png)

In [40]:
df

   key1  key2     data1     data2
0     a     1 -0.444223 -0.464610
1     a     2 -0.220714 -0.525475
2  None     1  2.188420 -1.584287
3     b     2 -0.032658 -0.825786
4     b     1  1.050650  0.362832
5     a  <NA>  0.809552 -0.531752
6  None     1 -0.190208 -2.672044

In [41]:
def peak_to_peak(arr):
    return arr.max() - arr.min()
grouped = df.groupby("key1")
grouped.agg(peak_to_peak)

      key2     data1     data2
key1
a        1  1.253775  0.067142
b        1  1.083308  1.188618

In [42]:
grouped.describe()

      key2                                           data1            ...  \
     count mean       std  min   25%  50%   75%  max count      mean  ...
key1                                                                  ...
a      2.0  1.5  0.707107  1.0  1.25  1.5  1.75  2.0   3.0  0.048205  ...
b      2.0  1.5  0.707107  1.0  1.25  1.5  1.75  2.0   2.0  0.508996  ...

                         data2                                          \
           75%       max count      mean       std       min       25%
key1
a     0.294419  0.809552   3.0 -0.507279  0.037085 -0.531752 -0.528614
b     0.779823  1.050650   2.0 -0.231477  0.840480 -0.825786 -0.528632


           50%       75%       max
key1
a    -0.525475 -0.495043 -0.464610
b    -0.231477  0.065677  0.362832

[2 rows x 24 columns]

In [43]:
grouped.mean()

      key2     data1     data2
key1
a      1.5  0.048205 -0.507279
b      1.5  0.508996 -0.231477

In [44]:
grouped['data1'].sum()

key1
a    0.144616
b    1.017992
Name: data1, dtype: float64

## Column-Wise and Multiple Function Application

In [45]:
tips = pd.read_csv("examples/tips.csv")

In [46]:
tips.head()

   total_bill   tip smoker  day    time  size
0       16.99  1.01     No  Sun  Dinner     2
1       10.34  1.66     No  Sun  Dinner     3
2       21.01  3.50     No  Sun  Dinner     3
3       23.68  3.31     No  Sun  Dinner     2
4       24.59  3.61     No  Sun  Dinner     4

In [47]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [48]:
tips.head()

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808

In [49]:
grouped = tips.groupby(['day', 'smoker'])

In [50]:
grouped_pct = grouped['tip_pct']

In [51]:
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [52]:
grouped_pct.agg(["mean", "std", peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

 Thus, if you
 pass a list of (name, function) tuples, the first element of each tuple will be used
 as the DataFrame column names

In [53]:
grouped_pct.agg([('average', 'mean'), ('stdev', np.std)])

C:\Users\ahamm\AppData\Local\Temp\ipykernel_10788\2678368431.py:1: FutureWarning: The provided callable <function std at 0x000002AF75A7B740> is currently using SeriesGroupBy.std. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "std" instead.
  grouped_pct.agg([('average', 'mean'), ('stdev', np.std)])

              average     stdev
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [54]:
functions = ['count', 'mean', 'max']
result = grouped[['tip_pct', 'total_bill']].agg(functions)
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [55]:
result['tip_pct']

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [56]:
ftuples = [("Average", "mean"), ("Variance", np.var)]
grouped[["tip_pct", "total_bill"]].agg(ftuples)

C:\Users\ahamm\AppData\Local\Temp\ipykernel_10788\4198102554.py:2: FutureWarning: The provided callable <function var at 0x000002AF75A7B920> is currently using SeriesGroupBy.var. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "var" instead.
  grouped[["tip_pct", "total_bill"]].agg(ftuples)

              tip_pct           total_bill
              Average  Variance    Average    Variance
day  smoker
Fri  No      0.151650  0.000791  18.420000   25.596333
     Yes     0.174783  0.002631  16.813333   82.562438
Sat  No      0.158048  0.001581  19.661778   79.908965
     Yes     0.147906  0.003767  21.276667  101.387535
Sun  No      0.160113  0.001793  20.506667   66.099980
     Yes     0.187250  0.023757  24.120000  109.046044
Thur No      0.160298  0.001503  17.113111   59.625081
     Yes     0.163863  0.001551  19.190588   69.808518

In [59]:
tips

     total_bill   tip smoker   day    time  size   tip_pct
0         16.99  1.01     No   Sun  Dinner     2  0.059447
1         10.34  1.66     No   Sun  Dinner     3  0.160542
2         21.01  3.50     No   Sun  Dinner     3  0.166587
3         23.68  3.31     No   Sun  Dinner     2  0.139780
4         24.59  3.61     No   Sun  Dinner     4  0.146808
..          ...   ...    ...   ...     ...   ...       ...
239       29.03  5.92     No   Sat  Dinner     3  0.203927
240       27.18  2.00    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Yes   Sat  Dinner     2  0.088222
242       17.82  1.75     No   Sat  Dinner     2  0.098204
243       18.78  3.00     No  Thur  Dinner     2  0.159744

[244 rows x 7 columns]

In [57]:
grouped.agg({'tip': np.max, 'size':np.sum})

C:\Users\ahamm\AppData\Local\Temp\ipykernel_10788\2568873011.py:1: FutureWarning: The provided callable <function amax at 0x000002AF75A7A840> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  grouped.agg({'tip': np.max, 'size':np.sum})
C:\Users\ahamm\AppData\Local\Temp\ipykernel_10788\2568873011.py:1: FutureWarning: The provided callable <function sum at 0x000002AF75A79EE0> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  grouped.agg({'tip': np.max, 'size':np.sum})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [60]:
grouped.agg({'tip_pct':['min', 'max', 'mean', 'std']})

              tip_pct
                  min       max      mean       std
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123
     Yes     0.103555  0.263480  0.174783  0.051293
Sat  No      0.056797  0.291990  0.158048  0.039767
     Yes     0.035638  0.325733  0.147906  0.061375
Sun  No      0.059447  0.252672  0.160113  0.042347
     Yes     0.065660  0.710345  0.187250  0.154134
Thur No      0.072961  0.266312  0.160298  0.038774
     Yes     0.090014  0.241255  0.163863  0.039389